const ERROR_MESSAGES = {
    login: {
        INVALID_CREDENTIALS: "البريد الإلكتروني أو كلمة المرور غير صحيحة",
        USER_NOT_FOUND: "لم يتم العثور على حساب بهذا البريد الإلكتروني. يرجى التحقق من بريدك الإلكتروني أو إنشاء حساب جديد",
        VALIDATION_ERROR: "يرجى التحقق من المعلومات والمحاولة مرة أخرى",
        SERVER_ERROR: "نواجه صعوبات تقنية. يرجى المحاولة مرة أخرى لاحقاً",
        DEFAULT: "حدث خطأ أثناء تسجيل الدخول. يرجى المحاولة مرة أخرى"
    },
    signup: {
        VALIDATION_ERROR: "يرجى التحقق من المعلومات المدخلة والمحاولة مرة أخرى",
        DUPLICATE_USER: "البريد الإلكتروني أو اسم المستخدم مسجل مسبقاً",
        SERVER_ERROR: "نواجه صعوبات تقنية. يرجى المحاولة مرة أخرى لاحقاً",
        DEFAULT: "حدث خطأ أثناء إنشاء الحساب. يرجى المحاولة مرة أخرى"
    },
    logout: {
        DEFAULT: 'حدث خطأ أثناء تسجيل الخروج',
    },
    auth: {
        UNAUTHORIZED: "يرجى تسجيل الدخول للوصول إلى هذه الميزة",
    },
    thread: {
        SERVER_ERROR: "نواجه صعوبات تقنية. يرجى المحاولة مرة أخرى لاحقاً",
        DEFAULT: "حدث خطأ أثناء إنشاء المناقشة. يرجى المحاولة مرة أخرى",
        NOT_FOUND: "لم يتم العثور على المناقشة المطلوبة",
        VALIDATION_ERROR: "يرجى التحقق من المعلومات المدخلة والمحاولة مرة أخرى",
    },
};

export default ERROR_MESSAGES;